#+STARTUP: overview
#+TAGS: WORK(w) IMPROVEMENT(I) LIFE(l) FINANCE(f) READ(r)
#+STARTUP: hidestars


* ReaDock                                                              :WORK:

** PDBBind 2007
*** Distances profiling and Translating to tokens
1. ./src/eda.py
2. distribution of the ligand sizes in Angstrom
   /ddnB/work/jaydy/working/pdbbind/lig_sizes_hist.tiff
3. 10% quantile of distances is 13.08 Angstrom
4. distribution of the residue-atom distances
   /ddnB/work/jaydy/working/pdbbind/all_dists_hist.tiff
5. *Use an unique ligand size for translating*

*** DONE Use log of Kd and Ki as the target value
CLOSED: [2016-05-26 Thu 10:37] SCHEDULED: <2016-05-26 Thu>
:LOGBOOK:
CLOCK: [2016-05-26 Thu 10:19]--[2016-05-26 Thu 10:37] =>  0:18
:END:
pKd(pKi) is actually minus log of Kd(Ki)

*** DONE Use correlation as the evaluation metric
CLOSED: [2016-05-26 Thu 12:40]
1. Accuracy on the core set
   | BinningSize | MaxDf | MinDf |          RMSE |           Corr |
   |-------------+-------+-------+---------------+----------------|
   |         7.0 |   0.5 |   0.0 | 2.88353791658 | 0.651735802633 |
   |         7.0 |   0.5 |   0.1 | 2.95200736556 | 0.650286674418 |
   |         7.0 |   0.5 |   0.2 | 3.95248374374 | 0.424937438339 |
   |         7.0 |   0.6 |   0.0 | 2.68216516941 | 0.684319066719 |
   |         7.0 |   0.6 |   0.1 | 3.00405464214 | 0.629197009238 |
   |         7.0 |   0.6 |   0.2 | 3.90302429797 | 0.436009042173 |
   |         7.0 |   0.7 |   0.0 |  2.6949449908 | 0.680376381075 |
   |         7.0 |   0.7 |   0.1 |  2.9580650969 | 0.644970650906 |
   |         7.0 |   0.7 |   0.2 | 4.10950980449 | 0.378476060708 |
   |         7.0 |   0.8 |   0.0 | 2.66244100535 | 0.695189470417 |
   |         7.0 |   0.8 |   0.1 | 2.99766408599 | 0.633434418459 |
   |         7.0 |   0.8 |   0.2 | 4.04774861904 | 0.399364523668 |
   |         7.0 |   0.9 |   0.0 | 2.74429811251 | 0.665942007807 |
   |         7.0 |   0.9 |   0.1 | 3.23538989711 | 0.581682706186 |
   |         7.0 |   0.9 |   0.2 | 3.59772041198 | 0.497853312679 |
   |         7.0 |   1.0 |   0.0 | 2.46422973497 | 0.722709400475 |
   |         7.0 |   1.0 |   0.1 | 2.71666287594 | 0.683208141298 |
   |         7.0 |   1.0 |   0.2 | 2.87425435872 | 0.642237132977 |

*** RMSE v.s. Binning size
1. RMSE was measured on the core set
   | BinningSize | MaxDf | MinDf |            RMSE |
   |-------------+-------+-------+-----------------|
   |         8.0 |   0.5 |   0.0 |   3.15870011251 |
   |         8.0 |   0.5 |   0.1 |    3.4971982062 |
   |         8.0 |   0.5 |   0.2 |   3.74920364193 |
   |         8.0 |   0.6 |   0.0 |   3.00959909647 |
   |         8.0 |   0.6 |   0.1 |   3.32057175016 |
   |         8.0 |   0.6 |   0.2 |      3.72480672 |
   |         8.0 |   0.7 |   0.0 |   3.07659889925 |
   |         8.0 |   0.7 |   0.1 |   3.34285466802 |
   |         8.0 |   0.7 |   0.2 |   3.81979337198 |
   |         8.0 |   0.8 |   0.0 |   3.06496780321 |
   |         8.0 |   0.8 |   0.1 |   3.35530892064 |
   |         8.0 |   0.8 |   0.2 |   3.83592953176 |
   |         8.0 |   0.9 |   0.0 |   2.98246071914 |
   |         8.0 |   0.9 |   0.1 |   3.26009053775 |
   |         8.0 |   0.9 |   0.2 |   3.49944685369 |
   |         8.0 |   1.0 |   0.0 | *2.59827806759* |
   |         8.0 |   1.0 |   0.1 |   2.88624977155 |
   |         8.0 |   1.0 |   0.2 |   2.72234247786 |
   |-------------+-------+-------+-----------------|
   |         7.0 |   0.5 |   0.0 |   2.80708628128 |
   |         7.0 |   0.5 |   0.1 |   2.99796109668 |
   |         7.0 |   0.5 |   0.2 |   3.97301847166 |
   |         7.0 |   0.6 |   0.0 |   2.74699465989 |
   |         7.0 |   0.6 |   0.1 |   3.05103318973 |
   |         7.0 |   0.6 |   0.2 |   3.84795913711 |
   |         7.0 |   0.7 |   0.0 |   2.84415618139 |
   |         7.0 |   0.7 |   0.1 |   2.86401625861 |
   |         7.0 |   0.7 |   0.2 |   3.86485508663 |
   |         7.0 |   0.8 |   0.0 |   2.87092858503 |
   |         7.0 |   0.8 |   0.1 |   2.96729410717 |
   |         7.0 |   0.8 |   0.2 |   3.94495796492 |
   |         7.0 |   0.9 |   0.0 |    2.7512863831 |
   |         7.0 |   0.9 |   0.1 |   3.04675105412 |
   |         7.0 |   0.9 |   0.2 |   3.66776825968 |
   |         7.0 |   1.0 |   0.0 | *2.50161570995* |
   |         7.0 |   1.0 |   0.1 |   2.63568073561 |
   |         7.0 |   1.0 |   0.2 |   2.95979611166 |
   |-------------+-------+-------+-----------------|
   |         6.0 |   0.5 |   0.0 |   2.78419292791 |
   |         6.0 |   0.5 |   0.1 |   3.22715671615 |
   |         6.0 |   0.5 |   0.2 |   3.93841085041 |
   |         6.0 |   0.6 |   0.0 |   2.84565275957 |
   |         6.0 |   0.6 |   0.1 |    3.3436680107 |
   |         6.0 |   0.6 |   0.2 |   3.89361193988 |
   |         6.0 |   0.7 |   0.0 |   2.92387919422 |
   |         6.0 |   0.7 |   0.1 |   3.40615757176 |
   |         6.0 |   0.7 |   0.2 |   4.00475889056 |
   |         6.0 |   0.8 |   0.0 |   2.77643585112 |
   |         6.0 |   0.8 |   0.1 |   3.32365663636 |
   |         6.0 |   0.8 |   0.2 |   3.95908316691 |
   |         6.0 |   0.9 |   0.0 |   2.88735195059 |
   |         6.0 |   0.9 |   0.1 |   3.00431586481 |
   |         6.0 |   0.9 |   0.2 |   3.39218459893 |
   |         6.0 |   1.0 |   0.0 |   2.60232652834 |
   |         6.0 |   1.0 |   0.1 | *2.57113496535* |
   |         6.0 |   1.0 |   0.2 |   2.88323419701 |
   |-------------+-------+-------+-----------------|
   |         5.0 |   0.5 |   0.0 |   2.93859797176 |
   |         5.0 |   0.5 |   0.1 |   3.23573748535 |
   |         5.0 |   0.5 |   0.2 |   3.94693390962 |
   |         5.0 |   0.6 |   0.0 |   2.81679961005 |
   |         5.0 |   0.6 |   0.1 |   3.25913279529 |
   |         5.0 |   0.6 |   0.2 |    4.2375770537 |
   |         5.0 |   0.7 |   0.0 |   2.84257261925 |
   |         5.0 |   0.7 |   0.1 |   3.19517955187 |
   |         5.0 |   0.7 |   0.2 |   4.05363491635 |
   |         5.0 |   0.8 |   0.0 |   2.86301819187 |
   |         5.0 |   0.8 |   0.1 |    3.3251232907 |
   |         5.0 |   0.8 |   0.2 |   4.00050969393 |
   |         5.0 |   0.9 |   0.0 |   3.10484617925 |
   |         5.0 |   0.9 |   0.1 |   3.09546768428 |
   |         5.0 |   0.9 |   0.2 |   3.69146245861 |
   |         5.0 |   1.0 |   0.0 |   2.61909191037 |
   |         5.0 |   1.0 |   0.1 | *2.61473305155* |
   |         5.0 |   1.0 |   0.2 |   2.88078865904 |


* TODO PDBBind 2015                                                    :WORK:
SCHEDULED: <2016-05-26 Thu>--<2016-05-27 Fri> 
:LOGBOOK:
CLOCK: [2016-05-26 Thu 15:40]--[2016-05-26 Thu 16:05] =>  0:25
CLOCK: [2016-05-26 Thu 14:49]--[2016-05-26 Thu 15:14] =>  0:25
:END:

** DONE Download the dataset
CLOSED: [2016-05-26 Thu 15:40]

** DONE ETL
CLOSED: [2016-05-27 Fri 13:41] SCHEDULED: <2016-05-26 Thu>
:LOGBOOK:
CLOCK: [2016-05-27 Fri 13:00]--[2016-05-27 Fri 13:25] =>  0:25
:END:
1. [X] binding affinity
   1. [X] ./src/extract_affinity.py
   2. [X] ./src/aff_2015.py
2. [X] Build tokens
   1. ./src/translate.py

** TODO Exploratory and benchmarking analysis 
SCHEDULED: <2016-05-27 Fri>
:LOGBOOK:
CLOCK: [2016-05-27 Fri 13:41]--[2016-05-27 Fri 14:06] =>  0:25
:END:

*** DONE Optimization of Meta parameters
CLOSED: [2016-05-27 Fri 14:02]
1. training and validating data
   #+BEGIN_SRC python
     rf = RF15(binning_size=6.0)

     refined_df, core_df = rf.split()

     refined_df.shape
     # Out[30]: (3515, 3)

     core_df.shape
     # Out[36]: (190, 3)
   #+END_SRC

2. Benchmarking accuracies
    4184 unique tokens
    | BinningSize | MaxDf | MinDf |          RMSE |             Corr |
    |-------------+-------+-------+---------------+------------------|
    |         8.0 |   0.5 |   0.0 | 3.47050289811 |   0.562742272917 |
    |         8.0 |   0.5 |   0.1 | 4.18150344505 |   0.384288225967 |
    |         8.0 |   0.5 |   0.2 | 4.41465230271 |   0.317765957936 |
    |         8.0 |   0.6 |   0.0 | 3.39424713389 |   0.577642772013 |
    |         8.0 |   0.6 |   0.1 | 4.01646559294 |   0.428431026551 |
    |         8.0 |   0.6 |   0.2 | 4.09874093265 |   0.412266898365 |
    |         8.0 |   0.7 |   0.0 | 3.39224112716 |   0.584871161416 |
    |         8.0 |   0.7 |   0.1 | 3.99437866779 |   0.437573718424 |
    |         8.0 |   0.7 |   0.2 | 3.97306242695 |    0.44878332011 |
    |         8.0 |   0.8 |   0.0 | 3.41399393768 |   0.579442413883 |
    |         8.0 |   0.8 |   0.1 | 3.86137457705 |   0.467205326878 |
    |         8.0 |   0.8 |   0.2 | 4.10698417326 |   0.408350300985 |
    |         8.0 |   0.9 |   0.0 | 3.59696609642 |   0.532328672574 |
    |         8.0 |   0.9 |   0.1 | 4.17116072547 |   0.389919668248 |
    |         8.0 |   0.9 |   0.2 | 3.93689297853 |   0.454493498124 |
    |         8.0 |   1.0 |   0.0 | 2.95101032716 | *0.655973789639* |
    |         8.0 |   1.0 |   0.1 | 3.36645096063 |   0.575165548714 |
    |         8.0 |   1.0 |   0.2 | 3.25439482653 |   0.596458855503 |

    5629 unique tokens
    | BinningSize | MaxDf | MinDf |          RMSE |             Corr |
    |-------------+-------+-------+---------------+------------------|
    |         7.0 |   0.5 |   0.0 | 3.47441459474 |   0.553441179573 |
    |         7.0 |   0.5 |   0.1 | 3.85881658737 |   0.463380700676 |
    |         7.0 |   0.5 |   0.2 | 4.34322824779 |   0.342525306388 |
    |         7.0 |   0.6 |   0.0 | 3.38235282168 |   0.577994388187 |
    |         7.0 |   0.6 |   0.1 | 3.72258422374 |   0.498662900787 |
    |         7.0 |   0.6 |   0.2 | 3.99465530726 |   0.446821697401 |
    |         7.0 |   0.7 |   0.0 | 3.37985420737 |   0.579346992078 |
    |         7.0 |   0.7 |   0.1 | 3.68413264884 |   0.512610969501 |
    |         7.0 |   0.7 |   0.2 |   4.291004276 |   0.356649151074 |
    |         7.0 |   0.8 |   0.0 | 3.24937908632 |   0.608663209719 |
    |         7.0 |   0.8 |   0.1 | 3.74643716168 |   0.501506958153 |
    |         7.0 |   0.8 |   0.2 | 4.18080424716 |   0.390956898762 |
    |         7.0 |   0.9 |   0.0 | 3.37463132295 |    0.58135922059 |
    |         7.0 |   0.9 |   0.1 | 3.78484513221 |   0.487680833659 |
    |         7.0 |   0.9 |   0.2 | 3.95070855495 |   0.450332485455 |
    |         7.0 |   1.0 |   0.0 | 2.89012613347 | *0.674469231708* |
    |         7.0 |   1.0 |   0.1 | 3.23904313537 |   0.599115207023 |
    |         7.0 |   1.0 |   0.2 | 3.32310557979 |   0.582287428371 |

    7488 unique tokens
    | BinningSize | MaxDf | MinDf |          RMSE |             Corr |
    |-------------+-------+-------+---------------+------------------|
    |         6.0 |   0.5 |   0.0 | 3.11815490547 |   0.636731914174 |
    |         6.0 |   0.5 |   0.1 |   3.515149244 |    0.54962638952 |
    |         6.0 |   0.5 |   0.2 | 4.18431294756 |   0.387747179352 |
    |         6.0 |   0.6 |   0.0 |      3.282995 |   0.592849274507 |
    |         6.0 |   0.6 |   0.1 | 3.65292287874 |   0.520772477082 |
    |         6.0 |   0.6 |   0.2 | 4.54167445474 |   0.283575712085 |
    |         6.0 |   0.7 |   0.0 | 3.11974308632 |    0.63245008201 |
    |         6.0 |   0.7 |   0.1 | 3.49152366695 |   0.558178908308 |
    |         6.0 |   0.7 |   0.2 | 4.14419282905 |   0.396759316135 |
    |         6.0 |   0.8 |   0.0 | 3.10909994105 |   0.635002569041 |
    |         6.0 |   0.8 |   0.1 | 3.54786106695 |   0.544906088125 |
    |         6.0 |   0.8 |   0.2 | 4.22273032253 |   0.378103448693 |
    |         6.0 |   0.9 |   0.0 | 3.25153282021 |   0.598922868404 |
    |         6.0 |   0.9 |   0.1 | 3.54551840211 |    0.53931994973 |
    |         6.0 |   0.9 |   0.2 | 4.12556704716 |   0.403258334521 |
    |         6.0 |   1.0 |   0.0 | 2.78062059389 | *0.687218841744* |
    |         6.0 |   1.0 |   0.1 | 3.03812125768 |   0.642320355141 |
    |         6.0 |   1.0 |   0.2 | 3.38676572337 |   0.563015494614 |

    11388 unique tokens
    | BinningSize | MaxDf | MinDf |          RMSE |             Corr |
    |-------------+-------+-------+---------------+------------------|
    |         5.0 |   0.5 |   0.0 | 3.36917681579 |   0.578170780547 |
    |         5.0 |   0.5 |   0.1 | 3.78227637338 |    0.48252935189 |
    |         5.0 |   0.5 |   0.2 | 4.16429153463 |   0.389575886216 |
    |         5.0 |   0.6 |   0.0 |   3.334672604 |   0.589675201182 |
    |         5.0 |   0.6 |   0.1 | 3.66199663347 |   0.517516389451 |
    |         5.0 |   0.6 |   0.2 | 4.10217578232 |   0.406358919264 |
    |         5.0 |   0.7 |   0.0 | 3.32074622695 |   0.590104471548 |
    |         5.0 |   0.7 |   0.1 | 3.87442311158 |   0.460637538236 |
    |         5.0 |   0.7 |   0.2 | 3.82425223684 |   0.477734785478 |
    |         5.0 |   0.8 |   0.0 | 3.24122898526 |   0.612105551457 |
    |         5.0 |   0.8 |   0.1 | 3.82567968947 |   0.472762177825 |
    |         5.0 |   0.8 |   0.2 | 3.87554764295 |   0.464512491473 |
    |         5.0 |   0.9 |   0.0 | 3.26451211095 |   0.596793265207 |
    |         5.0 |   0.9 |   0.1 | 3.71085865832 |   0.499942058256 |
    |         5.0 |   0.9 |   0.2 | 4.05531035242 |    0.41670014043 |
    |         5.0 |   1.0 |   0.0 | 3.14879903811 | *0.618740549372* |
    |         5.0 |   1.0 |   0.1 | 3.18878678421 |   0.612996765783 |
    |         5.0 |   1.0 |   0.2 | 3.31720616884 |   0.578156744652 |
